In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
# 1.Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place.
#Fill in these missing numbers and make the column an integer column(instead of a float column).
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [ ]:
new=np.arange(1,df.From_To.count()+1)
new
for i in new:
  if pd.isnull(df.FlightNumber.loc[i]):
    df.FlightNumber.loc[i] = df.FlightNumber.loc[i-1]+10
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df['FlightNumber']

1    10045.0
2    10055.0
3    10065.0
4    10075.0
5    10085.0
Name: FlightNumber, dtype: float64

In [ ]:
df['FlightNumber']=df['FlightNumber'].astype(int)
df['FlightNumber']

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int64

In [ ]:
# 2.The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary DataFrame.
df['From_To']

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

In [ ]:
df1 = df.copy()
df1[['From','To']] = df1.From_To.str.split("_",expand=True)
df1

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris         10045  ...    LoNDon      paris
2      MAdrid_miLAN         10055  ...    MAdrid      miLAN
3  londON_StockhOlm         10065  ...    londON  StockhOlm
4    Budapest_PaRis         10075  ...  Budapest      PaRis
5   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [ ]:
# 3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)

df1.From_To = df1.From_To.str.capitalize()
df1.From = df1.From.str.capitalize()
df1.To = df1.To.str.capitalize()
df1

            From_To  FlightNumber  ...      From         To
1      London_paris         10045  ...    London      Paris
2      Madrid_milan         10055  ...    Madrid      Milan
3  London_stockholm         10065  ...    London  Stockholm
4    Budapest_paris         10075  ...  Budapest      Paris
5   Brussels_london         10085  ...  Brussels     London

[5 rows x 6 columns]

In [ ]:
# 4.Delete the From_To column from df and attach the temporary DataFrame from the previous questions.
df.drop('From_To',axis=1,inplace=True)

   FlightNumber  RecentDelays              Airline
1         10045      [23, 47]               KLM(!)
2         10055            []    <Air France> (12)
3         10065  [24, 43, 87]  (British Airways. )
4         10075          [13]       12. Air France
5         10085      [67, 32]          "Swiss Air"

In [ ]:
df['From_To'] = df1['From_To']
df

   FlightNumber  RecentDelays              Airline           From_To
1         10045      [23, 47]               KLM(!)      London_paris
2         10055            []    <Air France> (12)      Madrid_milan
3         10065  [24, 43, 87]  (British Airways. )  London_stockholm
4         10075          [13]       12. Air France    Budapest_paris
5         10085      [67, 32]          "Swiss Air"   Brussels_london